import random  # Підключаємо бібліотеку для генерації випадкових чисел

# Генеруємо випадкове число від 1 до 10
Secret= random.randint(1, 10)

# Просимо гравця ввести число
спроба = int(input("Введи число від 1 до 10: "))

# Перевіряємо результат
if Attempt == Secret:
    print(" Вау! Ти екстрасенс! ")
elif Attempt < Secret:
    print(f"Мимо! число більше, ніж {спроба}. (")
else:
    print(f"Не вгадав! число менше, ніж {Attempt}. (")

# Відкриваємо секрет
print(f"Секретне число було: {Secret}! ")